{"pages":[{"text":"Drawn on Inkinite Reusable Notebook Using Staedtler Correctable Marker Copied Yes Source From a book about R K Laxman, at my Son's library I started drawing again (seriously) after watching a youtube video of Graham Shaw from TEDx Hull, where he teaches \"everyone\" to draw. One of the drawing reminded me of the caricature of a \"common man\" made famous by eminent cartoonist R K Laxman. I've been meaning to draw the \"common man\" ever since. Today, when I went to my son's library, I came across this book about R K Laxman, with few illustrations. Luckily, these days I carry my \"portable\" whiteboard aka Inkinite notebook everywhere. I requested the librarian whether I can spend a little time drawing sketches. She didn't mind. (Thanks) Earlier, I had written about how my \"scanning\" using smartphone camera was not generating good results. Around that time, I read about scanning using \"actual\" scanner. So today, I decided to just do that. I had never used scanner with OSX (now macOS) since I purchased MBP. But that turned out to be \"no op\" I scanned this at 300 dpi and \"Black and White\" mode. Saved the image as PNG (cause it is a lossless format) File sizes were much better too. Around 300+ KB, as opposed to earlier ones being in MBs. I scanned three other sketches as well, and difference in the quality was visibly better.","tags":"sketches","loc":"http://mandarvaze.github.io/2016/12/drawing-r-k-laxman.html","title":"Sketches"},{"text":"Drawn on Inkinite Reusable Notebook Using Staedtler Correctable Marker Copied Yes Source Medium Article These faces are different than previous faces I had drawn from Graham Shaw \"method\" These are simpler, or just different ? eyes are smaller, easier. Smiles too. Rest of the \"elements\" are similar to the Graham Shaw style. In any case, a different style I can use when I draw some faces \"on my own\" As I mentioned in my earlier post. I need a better way to \"post process\" these \"scans\" They don't look bad, but could be better. Feel free to suggest ideas to \"scan\" better, in comments.","tags":"sketches","loc":"http://mandarvaze.github.io/2016/12/drawing-relatives.html","title":"Sketches"},{"text":"Drawn on Samsung Galaxy Note 8 Using Autodesk SketchbookX Copied Yes Source Loksatta (Marathi Newspaper) 04 Dec 2016 I drew on the Android tab after a long time. I usually draw on \"paper\" (more about this elsewhere) and then scan it in. I haven't perfected the \"scanning\" yet. I just take a photo using the android phone, and do slight editing to make the image look a little better. This time around, when I did that, I remembered the last image I had drawn on the tablet, and the \"white\" background was not anything like I could get using \"slight\" editing of the \"photographed\" sketches. So I decided to \"go back\" to drawing on the tab. While the resultant image is much better, drawing on the \"glass\" surface is not same as drawing on \"paper\" (On the other hand, it was much easier to \"paint\") I do not want to a complex and time consuming \"post-processing\". Drawing these pictures usually takes 10-15 minutes. I don't want to spend more time post-processing than it took to draw the original drawing. Feel free to suggest ideas to \"scan\" better, in comments.","tags":"sketches","loc":"http://mandarvaze.github.io/2016/12/drawing-kids-in-winter.html","title":"Sketches"},{"text":"Getting started Easiest way to get started on Mac is : brew install xonsh This installed older version than one released. It was good to try xonsh for the first time. But the documentation was newer than the software (imagine that) So I removed it. But in the process it installed python 3.5.1 (as a dependency) I still have python 3.4.2 from earlier brew installation, but now it was \"orphan\" Problem Now that I had python 3.5.1. as my default python, it caused a bit of problem, (it felt like a big problem in the beginning) since lot of stuff that was installed on 3.4 was not available anymore. Main problem was virtualenvwrapper - which had references in my .zshrc but \"new\" python site packages did not have it installed. So I had to pip3 install virtualenv pip3 install virtualenvwrapper Now virtualenvwrapper errors went away. Getting started .. again Since brew had older version, I decided to use pip instead pip3 install xonsh $ xonsh --version xonsh/0.4.4 Next step was configuring xonsh via the wizard. When I had run xonfig wizard earlier, I had selected a few of the xontribs but they were not installed, so when I started xonsh I got ImportWarning It would be good if the wizard offered only the xontribs that are available, better still, offer to invoke pip to install the missing xontribs that user has selected to use. Off course, xonsh team is aware of this. Anyway, way to install these are via pip. pip3 install xonsh-autoxsh pip3 install xontrib-avox pip3 install xontrib-prompt-ret-code Better Prompt Default toolkit (Is that the right term?) used by xonsh is gnureadlines but the alternative is way superior. pip3 install prompt_toolkit Now my prompt was pimped \"up\" - nice autocompletions ala fish (I forgot to mention that I had brew install bash-completion earlier) But I got an error that pygments was missing, so pip3 install pygments Now all is well :) Some tips Colour Style Now that I got a nicer shell, ensure that you set the color style of your choice. xonfig styles will all the \"themes\" available. I started with monokai since I use it elsewhere as well. But trying new theme is as simple as changing the variable name is running xonsh shell !!!! $ XONSH_COLOR_STYLE = 'native' Environment Variables If you have seen the pycon 2016 video , about xonsh or read the documentation throughly you probably know about ${...} This command lists all the environment variables For useful environment variables, see http://xon.sh/envvars.html History The documentation boasts of rich history, but I had problem related to history command not working In the process, I upgraded to version 0.4.5 where there were several history related fixes/improvements. But the problem did not go away. But there is a workaround. See the details and the workaround here See update . Concluding thoughts I am still not ready to make xonsh my default shell (yet) There are certain problems that prevent me from switching, but out of (say) 10 terminal tabs I have open, at least 8 are running xonsh - That is not bad :) I encourage you to try xonsh especially if you are python developer. I'm sure you will not be disappointed. Update: Sept 13, 2016 xonsh version 0.4.6 prevents this problem by not allowing to overwrite the built-in aliases like history and ls","tags":"explore","loc":"http://mandarvaze.github.io/2016/08/xonsh-python-shell.html","title":"xonsh : python-ish BASHward looking shell"},{"text":"Note These issues apply to me . If you find some of these useful, great. The post is not intended as an advice to you . Background Recently I heard the talk python to me podcast where A. Jesse Davis was interviewed. The topic was a bit different than usual python related topics. It was about how to make blogging easy. Jesse talks about several nice things, including the fact that why we should not feel guilty for not blogging regularly. You should listen to the podcast here if you have not. So the idea was at the back of my mind for a while, and this post is sort of brain dump of why I am unable to publish regularly inspite of having content written. Finalize the source format I kept moving between org and rst . I liked org when I started using emacs. (In fact that was the reason to start using emacs) So few of my initial posts are in org I had one post in asciidoc as well. But I think I will stick to reStructuredText mainly because most of the static site generators will have support for this format. Even bigger number probably support markdown but then there is no standardization, you have too many flavors out there. Also, I think rst is bit more richer than markdown I had one post in asciidoc as well Create/Use templates In order to get the thoughts on paper (so to speak) I start typing in an empty file. By the time I am done, I have very unformatted text that requires \"formatting\", and this is where the delay in \"publishing\" comes in. I have so many written-but-unpublished posts. Having templates with headers and categories/tags pre-populated would be good way to reduce the friction. Jesse talks about how we mostly have about 5 different types of posts. May be create just 5 templates for 5 \"types\" of blogs, and remove the decision making from choosing the categories and tags. (I never remember the list of categories and tags I have used, and always have to search the older posts to get the list, sorta) On second thoughts, I think nikola already has a script to create a new posts. May be I ought to use that ? Write more frequently This may seem confusing. Let me explain. As I mentioned that I usually start writing as a plain text, and later \"format\" the contents. One of reasons why this happens is because I can't remember the syntax at the time of writing. (and that happens when one keeps switching between org to rst to md . See the first point.) If I write more often using only one platform, the \"formatting\" syntax will be part of my memory. I already write the documentation (using sphinx) in rst - another reason to finalize on rst over org or md Finalize the blogging platform I have one blog in pelican. (This one. updated after a long time) and other blog in nikola. Switching between them just takes mental effort. If I were to standardize on it, there won't be \"switching trouble\" I also want to consider hugo , but my initial attempts to get a blog rolling with a theme-that-i-like hasn't worked well. But irrespective of the blog generator, if I standardize on reStructuredText, I don't have to worry about switching the blog generators (I think) Finalize the blog home On a related note, having single home for my blogs also might be good idea. It is always an effort to decide where should a specific post go. While with my second blog, the idea is very clear - it is about \"what I learnt\", so things like \"thoughts\" should not go there. Yet, sometimes it is not easy. May be just have one blog with category as \"wiltw\" (short for \"What I learnt this week\") Focus on the content I am never happy with the themes. I was almost happy with Material Design theme for nikola, but it could not render bullets (can you imagine?) So I switched to a simpler theme. But I am not happy. But I should just pick one up, stick with it, and not worry about the \"look\" I have read several great blogs that look down right ugly, but the contents are worth in gold. Publish now, refine later Perfectionist in me wants to read-edit-read a LOT after my initial writing is done. I spend a lot of time in this. May be I should just publish it first, and then refine it.","tags":"thoughts","loc":"http://mandarvaze.github.io/2016/08/easier-blogging.html","title":"6 things to make (my) blogging frictionless"},{"text":"Background I have been meaning to buy a Macbook for quite some time. No doubt, they are way above the average. The very first one I saw (in hand) years ago, was Macbook air. It was so thin (and there was so much press coverage) I adored the thinness and left it at that. There was anti-osx/apple \"majority\" in that startup, all the developers used Linux, and the \"boss\" had iPad, and Macbook air. So it was considered \"business\" machine (The cost also kinda justified that only the executives could afford it) Over the years, I started noticing more macs in the developer community. Couple years ago, I attended an Advanced Python course. The instructor was using Mac, not only that, one of the student was also using mac. Since we spent 3 days together, I asked him a lot of questions about mac. Still nothing for another year. Then one of the person I worked with (Earlier) bought Macbook air (used) He used to be a die-hard ubuntu user. Things were changing. (When I met him recently, turns out he installed Ubuntu on the Macbook air. People don't change who they are.) Then recently, one of my junior colleague bought Macbook pro. That probably was the last straw on the camel's back. I couldn't/shouldn't say any more that it is costly. Why Mac (my reasons) I always wanted a laptop that was light and had great battery life. Macbook is that, always. I didn't care so much for OS X. But I also knew that I could get the great battery life only with OS X. (I checked with the person who installed ubuntu on his Macbook air. Turns out he didn't get as great battery life, but _he_ didn't care. He still has very light weight Ubuntu laptop, with better screen) I honestly and seriously looked at the \"PC\" alternatives. None came even closer to the specs. When they did, they were costlier than Macbook Pro. In that sense, Macs are not \"expensive\". Also, most high-end \"PC\" laptops these days seem to come with touchscreen. That, I don't like. In that sense, I think Apple understands that touchscreen market is iPad, and laptop is a totally different market. So they kept them separate. Choosing the model If you look on the net for the comparison with the air, you'll see that pro and air are very close. For slightly(?) higher cost, pro is a better machine, for a developer anyway. Also, if you buy in India, air comes only with 4GB RAM, while pro comes with 8GB. Considering that macs can't be hardware upgraded, maxing out the specs in the available budget is the only option. I thought 128GB SSD (Entry level option) may be turn out to be restrictive, if I decide to dual-boot. So I went with 256GB (512GB would have been even better, but the cost goes up) 15\" has better specs (16GB default RAM) but it is heavy (and cost goes up) The Wait I had been \"thinking\" for almost 4 months. I asked my mac user friends for some advice(Should I go for \"older\" model to save the money. They suggested to go with the latest model) Yet I was not able to make up my mind whether I \"need\" the mac. WAF (Wife Acceptance Factor) was also a concern, buy she easily agreed. (I didn't wait to check \"why\" she agreed so easily, lest she changed her mind) Finally, decided to take the plunge (It really was that) Normally people order online, and \"wait\" for few days. But I was lucky. I purchased from someone who supplied hardware at my wife's office. I did the payment around noon, and by 2PM, I had the laptop in my hand. But in case you order online, there is a great discussion on quora on what to do while waiting for your mac to arrive. I had done that and more research while I was still making up my mind. e.g. Turns out OS X file system is case-insensitive (but case preserving) Having used Linux (and *nix) for over 2 decades, my instincts were to convert the file system to case-sensitive (There is an option to do that) But after enough warnings, I decided not to. (I know I am never going to install Adobe products that won't install on case-sensitive file system, or install \"Steam\", yet being new to OS X, I want to respect their choice.) I had also known about iTerm2, Adium, homebrew and the likes. First Impressions The screen is gorgeous. It is one thing to read about it, but to experience it, is a completely different matter. Everything just looks better. Trackpad is awesome. multi-touch gestures are natural. e.g. To see the notification panel on the right, feels as if, you are using the touch screen to \"bring it in\", except via the Trackpad. Out of the box, battery remaining was shown as 12+ hours - Amazing. It is unclear how the remaining battery life is calculated, because it keeps going up and down. \"Apps using significant energy\" is a nice touch, Turns out Google Chrome sucks battery, but over a period I realized that Firefox isn't any better, neither is safari. I don't have the numbers, this is based on what is reported as \"Apps using significant energy\". (Teething) Problems During the First bootup, there is a step to automatically set the timezone based on the location. But that did not work, so I had to set it up manually. No big deal but .. After selecting the timezone, I had to set the city. I was amazed to see that Pune or Mumbai were not listed, but smaller cities like solapur, nanded, nagpur were. I had to type in, then Found Pune. Not sure how the initial city list is populated. Again, No big deal but .. Having never used OSX, I didn't know \"How to get started\", was looking for \"Tour\". Didn't find anything obvious. Was under \"Finder -> help. Macbok Pro Essentials \"Free\" book was suggested, at the end of the \"Get to know your Mac\" It kept on downloading - but never could open it. So I asked for help on the apple forum. Problem solved : https://discussions.apple.com/thread/7021641 Concluding thoughts I think the move was worth it. Now there is no \"going back\". I know why people love Mac from \"this\" side. If you are a software developer, and can afford it, you should definitely \"switch\" If you think you can't afford it, think again ;) If you can't afford now , start saving ;)","tags":"thoughts","loc":"http://mandarvaze.github.io/2015/05/move-to-macbook.html","title":"Moving to Macbook"},{"text":"Intro I'm working on a Flask based API server (why Flask, why not xyz - is a topic for another discussion, but FWIW I am considering Django) As you know, Flask is a micro framework - that means a lot of \"features\" that are built-in into other frameworks aren't part of Flask. But there are several third party Flask extension. Flask-Security is one of them (Flask-Restless is another one I'll be using) Unfortunately, documentation for Flask-Security isn't up to the mark (at least as of this writing). I know this could be flame-bait, but it is not. Sometimes users need more sample code along with documentation, which seems to be missing here, and I am not alone. Just looking at the SO and other places people are \"stuck\" - lack of tutorials is evident. I went thru the documentation, SO links, Google Searches, Flask-Security code walk thru, debugging that code, looking at the Flask-Security test cases. All of it finally was worth it, because I was able to get Token based Authentication to work. Define User and Roles Basic code that defines the User and Role classes, initializes Flask-Security extension. This is not different from what is available in the documentation (Except may be additional attributes for User class) # A base model for other database tables to inherit class Base ( db . Model ): __abstract__ = True id = db . Column ( db . Integer , primary_key = True ) created_at = db . Column ( db . DateTime , default = db . func . current_timestamp ()) modified_at = db . Column ( db . DateTime , default = db . func . current_timestamp (), onupdate = db . func . current_timestamp ()) roles_users = db . Table ( 'roles_users' , db . Column ( 'user_id' , db . Integer (), db . ForeignKey ( 'auth_user.id' )), db . Column ( 'role_id' , db . Integer (), db . ForeignKey ( 'auth_role.id' ))) class Role ( Base , RoleMixin ): __tablename__ = 'auth_role' name = db . Column ( db . String ( 80 ), nullable = False , unique = True ) description = db . Column ( db . String ( 255 )) def __init__ ( self , name ): self . name = name def __repr__ ( self ): return '<Role %r >' % self . name class User ( Base , UserMixin ): __tablename__ = 'auth_user' email = db . Column ( db . String ( 255 ), nullable = False , unique = True ) password = db . Column ( db . String ( 255 ), nullable = False ) first_name = db . Column ( db . String ( 255 )) last_name = db . Column ( db . String ( 255 )) active = db . Column ( db . Boolean ()) confirmed_at = db . Column ( db . DateTime ()) last_login_at = db . Column ( db . DateTime ()) current_login_at = db . Column ( db . DateTime ()) # Why 45 characters for IP Address ? # See http://stackoverflow.com/questions/166132/maximum-length-of-the-textual-representation-of-an-ipv6-address/166157#166157 last_login_ip = db . Column ( db . String ( 45 )) current_login_ip = db . Column ( db . String ( 45 )) login_count = db . Column ( db . Integer ) roles = db . relationship ( 'Role' , secondary = roles_users , backref = db . backref ( 'users' , lazy = 'dynamic' )) def __repr__ ( self ): return '<User %r >' % self . email # Setup Flask-Security user_datastore = SQLAlchemyUserDatastore ( db , User , Role ) security = Security ( app , user_datastore ) # Create a user to test with @app.before_first_request def create_user (): db . create_all () if not User . query . first (): user_datastore . create_user ( email = 'test@example.com' , password = 'test123' ) db . session . commit () Configurations In the config.py I have following flask security configurations (for now - more will come) SECURITY_PASSWORD_HASH = 'pbkdf2_sha512' SECURITY_TRACKABLE = True SECURITY_PASSWORD_SALT = 'something_super_secret_change_in_production' API Endpoint Add a dummy API endpoint like this : from flask_security import auth_token_required from flask import jsonify @app.route ( '/dummy-api/' , methods = [ 'GET' ]) @auth_token_required def dummyAPI (): ret_dict = { \"Key1\" : \"Value1\" , \"Key2\" : \"value2\" } return jsonify ( items = ret_dict ) Lets Test Now all the pieces are set. Lets test. Lets try whether authentication itself works. First change the @auth_token_required decorator to @http_auth_required Now you can now access the URL 127.0.0.1:5001/dummy-api/ via the browser. You will see a pop up dialog that asks for the username and password Enter the email as username and password we created earlier with create_user If you dismiss without username password - you should see message starting with \"Unauthorized\" If you entered the email and password correctly - you should see the dummy JSON data we returned in the browser page. One other option is to use a program like curl or http (I prefer this. pip install httpie ) e.g. $ http 127.0.0.1:5001/dummy-api/ HTTP/1.0 401 UNAUTHORIZED Content-Length: 271 Content-Type: text/html ; charset = utf-8 Date: Wed, 14 Jan 2015 07:56:55 GMT Server: Werkzeug/0.9.6 Python/3.4.0 Set-Cookie: session = eyJfaWQiOiIwZTMxMDBkNmMwNmY0MmQyNmU3MDBhYTZkMzUxZmM4OSJ9.B5eyxw.074cU7O6pJha_qomfuUOG2CvZNg ; HttpOnly ; Path = / WWW-Authenticate: Basic realm = \"Login Required\" <h1>Unauthorized</h1> <p>The server could not verify that you are authorized to access the URL requested. You either supplied the wrong credentials ( e.g. a bad password ) , or your browser doesn ' t understand how to supply the credentials required.</p> Now provide the authentication details, and see the expected response : $ http -a test@example.com:test123 127.0.0.1:5001/dummy-api/ HTTP/1.0 200 OK Content-Length: 63 Content-Type: application/json Date: Wed, 14 Jan 2015 08:03:50 GMT Server: Werkzeug/0.9.6 Python/3.4.0 Set-Cookie: session = eyJfaWQiOiIwZTMxMDBkNmMwNmY0MmQyNmU3MDBhYTZkMzUxZmM4OSJ9.B5e0Zg.9-MG7d6XQ3zFnsNEz6NR7LtEC6Y ; HttpOnly ; Path = / { \"items\" : { \"Key1\" : \"Value1\" , \"Key2\" : \"value2\" } } So far so good. I was able to achieve this without too much trouble (Actually that is not true, but ..) Lets move on to Token based Authentication. This is where things got a bit tricky (for me) There seemed to be several people on SO with similar problems. (Hence this post - so that others in future can get some help) First, before we forget, change the @http_auth_required decorator back to @auth_token_required Now to \"get\" the auth token. Per Flask Security documentation : Token based authentication is enabled by retrieving the user auth token by performing an HTTP POST with the authentication details as JSON data against the authentication endpoint. A successful call to this endpoint will return the user's ID and their authentication token. This token can be used in subsequent requests to protected resources. First of all - the documentation doesn't specify which authentication endpoint ? Do I need to create one, or does Flask-Security provide me one by default ? Turns out /login is that default provided by Flask-Security (An older post on flask mailing list mentioned /auth . May be it was, in 2012. Not anymore) Testing http_auth was easy, also it was a GET request. Performing POST request isn't trivial. At first I tried Postman client (Chrome Extension) - But it didn't work. Then on SO - I came across this post. While that person went with Flask-JWT - I didn't need to. It gave me an idea of using requests for the POST call. Another Configuration But before all is well - we need one entry in config.py as follows : # Without this get_auth_token via POST request w/ JSON data does not work # You keep getting \"CSRF token missing\" error WTF_CSRF_ENABLED = False Get the Token I did the following in ipython console - but one can very well convert this to a stand alone script, if needed. In [ 20 ]: import requests In [ 21 ]: import json In [ 22 ]: r = requests . post ( 'http://127.0.0.1:5001/login' , data = json . dumps ({ 'email' : 'test@example.com' , 'password' : 'test123' }), headers = { 'content-type' : 'application/json' }) In [ 23 ]: r . json () Out [ 23 ]: { 'meta' : { 'code' : 200 }, 'response' : { 'user' : { 'authentication_token' : 'WyIxIiwiY2UwZWY0MDFjYTA3MmJlODcyODkzYjYxOGQzZjk4YzUiXQ.B5e5Sg.qcsDcaMgiRqx21YTC0OwwnihINM' , 'id' : '1' }}} Now I can use this token with http as follows : $ http 127.0.0.1:5001/dummy-api/ Authentication-Token:WyIxIiwiY2UwZWY0MDFjYTA3MmJlODcyODkzYjYxOGQzZjk4YzUiXQ.B5e5Sg.qcsDcaMgiRqx21YTC0OwwnihINM HTTP/1.0 200 OK Content-Length: 63 Content-Type: application/json Date: Wed, 14 Jan 2015 08:26:48 GMT Server: Werkzeug/0.9.6 Python/3.4.0 Set-Cookie: session = eyJfaWQiOiIwZTMxMDBkNmMwNmY0MmQyNmU3MDBhYTZkMzUxZmM4OSJ9.B5e5yA.Oog7nYYA6zSvWjyS7mVUUropKj8 ; HttpOnly ; Path = / { \"items\" : { \"Key1\" : \"Value1\" , \"Key2\" : \"value2\" } } Success !!! Note: I'm yet to separate the Flask-Security related code into a separate file. When I did that hell broke loose. For now I have everything under myapp/__init__.py file. May be I'll cover that in another blog post","tags":"tutorial","loc":"http://mandarvaze.github.io/2015/01/token-auth-with-flask-security.html","title":"Token Based Authentication with Flask-Security"},{"text":"Showing initiative to help yourself Start ups are considered (by some) as best opportunity to advance one's career. Irrespective of your years of experience or previous background, start ups will let you work on variety of tasks without specifying boundary. It is sad when a start up employee says or thinks \"I am done working on what I was asked, and have no next task\" Unless it is your first day/week, you probably know the pulse of the organization. You also (should) know various projects/products/initiatives being perused. Start ups are always short of resources. There is always more work than people available. Show initiative, that is the only way to grow. If you keep expecting \"work to be assigned\" to you, you are probably not a good fit for a start up. What are the various things one can do when waiting for formally being assigned the next task ? Look at the bug tracking system : see which bugs/features you can address and volunteer for those. Even if you do not end up working on it, at least you would have now understood — probably unknown till now — part of the code. Learn new technology : This might be more time consuming, but you should be doing this anyway, probably along with your main assignment. Make performance improvements : Depending on the time you have till the next assignment, this may or may not be possible. But you can get started ☺ Review code written by peers. This helps you learn to write better code, also helps you reduce code review comments if any, especially if you are a junior associate. Check to see if you can help with non-development related work, and expand your mind by knowing other parts of business. This could be looking at front end code, if you are a back end developer, or vice versa. You can also try to get involved in non-technical work. Create an internal company newsletter. Try out new tools company can use for collaboration. Update the documentation. Write up suggested updates for the company website and send suggestions to the founders. If the company facebook/twitter account is non-functional or not well utilized, volunteer to run that. (Thanks Navin Kabra , for suggesting this entire bullet) Try to learn more about the domain you are working on. This might help you understand implicit requirements in your field of work. This is not restricted to start ups, People should be doing this in any organization, and there are lots of big companies where this is encouraged. I assumed more \"established\" companies may have problems when junior person \"tries to look around\", on the other hand start ups may welcome it. I'm sure there are exception in either cases. Thanks to Navin and Sushrut for Reviewing the draft and making this post better. Originally posted on Medium","tags":"thoughts","loc":"http://mandarvaze.github.io/2014/03/i-do-not-have-a-task.html","title":"I do not have a task"},{"text":"It does not solve world hunger Why do I think it is overrated ? It is because human beings are lazy by nature. I can probably cite biological reasons like caveman had to conserve energy, do not waste energy on things that can be avoided. But that was probably true in case of physicial work, but guess these lazy genes take over even in the information age... and I think our genes may not be wrong. Just look at this While it is fair to assume that lack of information definitely blocks , but having the information isn't the silver bullet either. I am not talking about the information overload either. Some of the examples of why I think it is overrated. I shared password for demo site w/ my boss multiple times via email - Even then, just before the demo he needs to ask the login credentials to me. It was always in his mailbox - but it is easier to ask. I spent a lot of time to write detailed root cause of a problem via email with my team mates. Still we have to have a meeting and discuss (and waste X hours multipled by Y developers ? when reading individually and spending time thinking and efforts to understand by oneself would have been more effective IMO) In the product I created : Customers have their \"TO DO\" list shown to them when they login, still they need email reminder before the task is due. So we send reminder 15 and 5 days before the task is due. Now their \"managers\" need email reminder 2 days before the task is due. There is online report for customers, still they expect the reports to be emailed to them. In all the cases - the lack of information was never a problem, neither was information overload (may be only in case where password was needed to be searched from lot of emails) This article was originally published on my other blog here","tags":"thoughts","loc":"http://mandarvaze.github.io/2014/02/info-fingertips-overrated.html","title":"Information at the fingertips is overrated"},{"text":"काल रात्री झोप कशी ती आलीच नाही, रात्र भर असं‌ जागरण झाल्यामुळे, आज सकाळी मी थोडा रडतच उठलो. पहीले पायावरचं पांघरूण बाजूला केले लाथा मार मारून, बाबा बाजूलाच होते, त्यामुळे मग थोडा थांबलो, काय करावं अशा विचारात होतो, बाजूला माझा आवडता लोड होता, तो घ्यावा असं वाटलं, म्हणून डाव्या कुशीवर वळलो, थोडं अडखळल्या सारखं झालं, मला परत रडू येणार असं वाटायला लागलं, अजून थोडा प्र्यत्न केला, उजवा पाय जोरात लोडाच्या दिशेने टाकला. आता बाबा अचानक ओरडू लागले, आईला बोलावू लागले, थोडा वेळ मी काय झालयं, असा विचार केला, मला काही कळेना, असू द्या, काही का असेना. एवढ्यात आजी, आजोबा, आणी आई आले, साधारण पणे, आता आई मला जवळ घेते, पण तिने चक्क mobile phone उचलला . . असो. आता पर्यंत मी पोटावर पालथा पडलो होतो, पण डावा हात पोटाखालीच अडकला होता, आता तोन्डातून लाळ गळायला लागली होती, पण हात काही निघेना, मग दोनही पाय पोटाखाली घेतले, मग पोट थोडं उचललं गेलं आणी हात सुटला . . . हुश्श . . इतका वेळ लांब उभी राहिलेली आई आता जवळ आली, आईच्या डोळ्यात पाणी होतं, तिने मला उचलून घेतले, आणि म्हणाली, \"सोना, आज तू मोठ्ठी प्र् गती केलीस, I am so proud of you\" मला काही कळलं नाही एवढं काय झालं ते, मला तर लोड घ्यायचा होता, तो तर नाहीच मिळाला, पण पोटावर पडलो ह्याचा ह्यांना एवढा कसला आनंद झालाय ? नंतर दिवसभर परत प्र् यत्न करून सुद्धा तसं काही जमलं नाहीच, हे लोक उगीच वाट बघत होते.","tags":"marathi","loc":"http://mandarvaze.github.io/2014/01/one-fine-morning.html","title":"एका सकाळची गोष्ट"},{"text":"Installing Ghost wasn't difficult at all, especially with all the great documentation supplied by Openshift community Email Setup As soon as I did initial deployment, I got a notification that I need to fix the email configuration. I went with default setup using the Mailgun setup recommended by the documentation Theme Setup Next thing was to change the default casper theme. This turned surprisingly difficult (here is where intuition that one builds due to the experience comes in handy .. more on that a little later) As listed on the ghost documentation I went to the marketplace gallary and liked Vapor and Ghostium themes. I assumed (not completely incorrect though) that I need to clone the theme projects into ../content/themes folder, along side the casper folder that came by default. I did the same for both the themes. Next thing was to \"apply\" these to my installation. After having these two theme folders, I thought all I needed was to restart the application using rhc app-restart appname So I went the settings page, but no new themes .. Hmm .. But I quickly realized that the way openshift deployments work (not unlike heroku, which I haven't used) is by pushing any changes to the git repo. So added both the theme folders to git (along with previous changes for the mail setup I did earlier. Restarted the app OK, now two new themes appeared in the drop down. Selected one, clicked \"Save\", went on to the main page, and ... Failed to lookup view \"index\" OK, so this theme may be bad, let me try another one. Same error. What could be wrong ? Google search revealed that this errors shows up when index.hbs and post.hbs files are missing (They were not for either of the themes) Luckily, I could go back to default casper theme. (But then I didn't like it so much, that is why I needed a different theme) So I tried another theme from the forums. This one was available only as a zip file.. and guess what - this worked. Hmm .. One of the theme I chose was a \"Featured\" theme, so it can't have wrong code .. I downloaded the ZIP file of the same repo from the github (contents would be same, except I won't be able to update the theme easily) As suggested somewhere - I had also checked the file permissions (all were 644/rw-r--r--) same as in the ZIP file. Intuition helps I'm not sure what made me use the ZIP files (from github) in place of the cloned repo. The previous theme that worked may have something to do with it. I think it is intuition from troubleshooting various problems over the years. But it worked. I got the zip file, and placed it at the same place, git commit/push/restart later, I was successfully able to apply the new theme. I am still not sure what is the difference, may be I'll troubleshoot more, but that would be the topic for another post. 2013 ended with a Bang !!! 2014 will be equally fulfilling and challenging. This article was originally published on the newly deployed ghost blog on openshift - Duh !! The reason to reproduce it here is because I haven't (yet) spent time to figure out if and how I can backup my posts. I've been bitten twice, so I am being careful. Plus this will remain my primary blog anyway, although publishing on Ghost was a pleasure, more on that later, in another post perhaps. Since I used reStructuredText format instead of markdown for this blog, it took a little more effort than I had expected","tags":"tutorial","loc":"http://mandarvaze.github.io/2013/12/ghost-on-openshift.html","title":"Ghost on Openshift"},{"text":"Before the Movie Some background first. Last time around, there was no publicity for the first movie, on the other hand, This time around there were Plenty of Shows, As well as enough Ads in the newspaper, although I did not see any trailer on any of the TV Channels. So during the first (and only) week there were plenty of shows of the movie , Unfortunately the timing was bad. One of the highly anticipated Hindi movie (''Dhoom 3\") was being released a week immediately after, So the Hobbit 2 would not get enough chance. Having said that when I went to watch the movie on a Thursday evening the movie theater was largely empty. Impressions I liked this movie better than the first one. This could be due to several reasons. The Frame rate I felt more engaged in this one compared to the fist part where I was too distracted by the surreal look of the film. Although it shouldn't matter since I didn't watch the first one in HFR either. BTW, the scene where Biblo reaches the tree tops to \"breath\" is really a great scene. While I had planned the watch this part in a different movie hall (and a 2D version if possible) it didn't happen. But I did see the movie in a larger auditorium of the same multiplex - This could have had a positive impact on an overall positive experience this time around. Less Dark Story Contents The part of the story is much more \"fun\" this time around, especially with Bilbo. Thorin is still dark and brooding. Last time there was only Gandalf to help our heroes - this time around, he is gone for a while and doesn't return till the end, but instead we have a pair of elves to help our heroes. What I didn't like (Spoilers) As I mentioned in the review of Part 1, I didn't like the fact that Peter Jackson did not stay true to the original book. As you might know, J.R.R. Tolkien first wrote \"The Hobbit\" - a tiny book compared to LOTR trilogy, and then he wrote an epic that is LOTR trilogy. Peter Jackson on the other hand, first make the LOTR trilogy - 3 books, 3 movies, and then made \"The Hobbit\" - 1 book, 3 movies. So he had to take a lot of liberty to make 3 movies worth material (For LOTR I'm sure he had exactly opposite problem - how to fit a book into a 3 hour movie) So he added several characters of his own like Bard, Tauriel in this part, and the entire dwarf-elf love story, and how did Legolas got into this book (Peter Jackson brought his here - due to his popularity in the other Trilogy - Thats how) and then why does Legolas have grey eyes here, when he had \"normal\" eyes in the other Trilogy, isn't he the same elf ? Tidbits I think Peter Jackson makes a cameo appearance in the opening scene of the movie, just before we reach \"The Prancing Pony\"","tags":"review","loc":"http://mandarvaze.github.io/2013/12/the-hobbit-desolation-of-smaug.html","title":"Review \"The Hobbit : The Desolation of Smaug\""},{"text":"As I have written in a previous post, I recently consolidated all of various blogs into this one. Big one was posterous, especially because it is going away in a few days time, and I had two separate blogs (spaces as they used to call it) with them. While the other posts talked about why this one talks about How Option 1 Posterous provides a backup of all your articles, in XML format. while initially I thought this format may not be useful for importing into pelican, looking back, it might be. I haven't tried it, so I don't know whether it helps. For more details refer to the pelican documentation Hopefully this is easier of the two routes. Option 2 First you need to \"get\" your postreous posts from their server to your local machine. You can use this original script. I had to make some changes to the script, to make it work for me. I suggest you keep both of them handy. I am not a ruby developer. so my changes are rudimentary, not the way ruby developer would do. But based on the logic, some old style debugging, and stackover help for ruby syntax, I was able to get it to work. Fun Begins For the script to work, you need (ruby off course) posterous \"gem\". Consider this as a library or a package, if you aren't familair with Ruby. not being a ruby programmer, I didn't know this, so I got the following error: $ sudo gem install posterous [ sudo ] password for mandar: Fetching: ffi-1.7.0.gem ( 100% ) Building native extensions. This could take a while ... ERROR: Error installing posterous: ERROR: Failed to build gem native extension. /usr/bin/ruby1.9.1 extconf.rb /usr/lib/ruby/1.9.1/rubygems/custom_require.rb:36:in ` require ': cannot load such file -- mkmf (LoadError) from /usr/lib/ruby/1.9.1/rubygems/custom_require.rb:36:in `require' from extconf.rb:4:in ` <main> ' Gem files will remain installed in /var/lib/gems/1.9.1/gems/ffi-1.7.0 for inspection. Results logged to /var/lib/gems/1.9.1/gems/ffi-1.7.0/ext/ffi_c/gem_make.out Some googline revealed that this is a know problem which can be fixed by sudo apt-get install ruby1.9.1-dev Now I was successfully able to install the posterous gem. Modifying posterous gem Original error went away, the script moved forward till the next error. The option: username is invalid. ( Ethon::Errors::InvalidOption ) Please try userpwd instead of username. Found the workaround on github posterous gem issues list Now that initial problem went away, I started getting the problems in the script itself. Good thing was I learnt debugging ruby script via printf method. Realized there was problem w/ save_media. So at first I commented this function call, and then eveything was OK. I successfuly downloaded all my posts from one of the blogs. Getting the images Now that I was partially successful, I wanted to make sure I get the images as well. So I added further debug/printf like statements, and in the process learnt about \"if my_object.nil? \" idiom With that I was able to get the images as well from my second blog. (and then another pass at my first blog, with images) This is just the beginning Now that you have your posts from posterous secured, the \"deadline\" pressure of posterous going away on April 30th, 2013 is removed. But I coulnd't just use the converted files as is. Markdown files didn't work with pelican directly, even after installing Markdown python module in my virtual environment. I ran into this error. ( BTW, you should totally boormark the article on which the comment is made ) So I hand converted the md files to rst. It didn't take that long, but was a manual process. Links from posterous don't work, especially for images that were uploaded to posterous. These links point to posterous' own Amazon S3 (which will also go away soon) But you have the images downloaded by the ruby script, so all the links need to be fixed (manually) I also did some editing. Not all my posts were moved. e.g. One of my posts \"Why posterous rocks\" didn't make it to this blog :) I am still learning the rst and pelican, so reference to local images folder works \"partially\" Luckily, most other places, I was already referring to third party image URL, so it didn't matter.","tags":"tutorial","loc":"http://mandarvaze.github.io/2013/04/posterous-to-markdown.html","title":"How to convert posterous blog to Markdown"},{"text":"This is my third attempt at blogging. Wordpress.com First one is still on hosted wordpress site. In a way, that is nice. Pretty much no administration needed. One can install the plugins that are tested by wordpress.com They also upgrade the platform for you. Great for testing the waters for the first time blogger. I think it is better than blogspot ( I can't remember if I had one of those, and moved to wordpress ) Self-hosted Wordpress But after a while one ( at least, I ) becomes ambitious. I had my own wordpress blog hosted on my own domain. It was a great experience. I got to try my hands at setting my blog just the way I want . But after initial excitement was over, it started to become burden. One had to spend a lot more time administering the blog (upgrade to latest version of wordpress, and the plugins) and less focus on writing. I never upgrade the blog to wordpress 3 ( which by now is very mature ) I always kept postponing it because upgrade might break things, so I would do it when I have enough time. Unfortunately, after a while I wasn't writing much, and stopped paying attention to the blog. I had also used my non-standard email ID with the hosting provider. The cascading effect was recently I lost access to my blog and the domain. It was completely my fault. My hosting provider did send multiple reminders for renewal, but I wasn't checking that account often enough, and when I finally did, they had probably given up. ( I did contact them later, but they ignored my emails ) But I definitely learnt a lot. Posterous Then while I still had my self-hosted wordpress blog, along came posterous. What I liked about them was I could post via email. I really liked the concept. They didn't great themes like wordpress, but if the focus was writing, then it shouldn't matter. .... and then they were acquired by twitter. As everyone had predicted, twitter shut them down. This was kinda the last straw. I had two blows back to back (One was my own fault, other not so much) But the result was in both cases, I had lost access to my blog. Finally, Static website ... This was the time, static website generators were picking up. Over at HN I came across several options like Octopress , Jekyll , Pelican . ( I chose Pelican because it is written in Python, language which I am comfortable with, as opposed to Jekyll and Octopress. ) It is easy to host the static website anywhere, include the Free Heroku plan (Which I might do in future) But hosting it on github seemed like an easy and popular choice. BTW, I did get a backup of all my posterous posts, but they were in XML format. Format which was not useful to me as-it-is. There is a ruby script that \"downloads\" all your posterous posts and converts them to markdown. It was not without problems, but it worked. But it is a topic for another post. Securing the source Based on my recent experience, I am aware that github might one fine day decide to stop supporting this feature. But if they did, that is OK too, because I will still have access to my contents in the git repo in the form of \"source code\" With Pelican I can re-generate the pages, and host it someplace else (like Heroku) What if github shuts down (or makes all accounts paid, or bought over my big company, and the parent company shuts it down, whatever..) I have already thought of contingency plan for that as well. I push the same \"code\" to bitbucket repo as well. While I think chances of both github and bitbucket going away at the same time are slim to none, One can always have the copy of local git repo in the dropbox folder, for additional security, Can you not ? :)","tags":"thoughts","loc":"http://mandarvaze.github.io/2013/04/why-move-to-static-blog.html","title":"Why I moved to Static Blog ?"},{"text":"After my trusty? Lenovo Thinkpad R400 developed problems (immediately after the 3 year warranty expired) I had to buy a new laptop. After initially thinking of ultrabook, I finally bought HP Pavilion m6. Since I needed this laptop for my work, I needed linux on it. I had tried a live USB on linux mint 13 before I paid for the machine, so I was sure that linux support would not be an issue. Live boot confirmed that display and Wireless worked without problems. Before I decided to make changes, I created the rescue disk (Just to be safe) I ended up needing those not long after :( - By the way, as an aside, it is important to note that rescue disk creator program does not accept DVR+RW the ones that can be used to write multiple times. So I had to go back to the shop to get them replaced. The main problem is that the machine already has 4 primary partitions. Thus linux installer is unable to create a new partition to boot from. After looking thru forums, I realized that HP_tools partition can be easily removed. Way to do is : First assign a drive letter to HP_TOOLS partition Copy the files to recovery partition Delete the HP_TOOLS partition - Recreate if needed, recreated as logical - thus solving max primary partitions problem. Once the max partition problem is resolved, installing linux isn't difficult. One other thing I did differently was to use Windows boot loader as default instead of GRUB (Felt safe at the time) I used EasyBCD So now I first get Windows bootloader which lets me choose between windows and Linux mint 14 (which is the default) But once I select Linux mint, I get GRUB bootloader (which also consists on Windows 7 entry) So may be I didn't need EasyBCD after all. YMMV.","tags":"tutorial","loc":"http://mandarvaze.github.io/2013/02/linux-on-hp-pavilion-m6.html","title":"Installing linux on HP Pavilion m6"},{"text":"Before I get into my own experience I have some complaints against Peter Jackson and his PR team. Hel,, the \"Rise of Guardians\" got better publicity (May be due to holiday season and it being kinds movie and/ot due to tie up with McDonald's) \"The Hobbit\" hardly got any publicity in Pune. If it were not for TV ads, I would not have even known it was released (and I would have mostly missed it) There aren't enough shows in Pune IMO. There were NO ads in the Movie Ads page in DNA. In addition to all this, Dabbang 2 is releasing next week, taking up all the screens. So my only chance was in the first week. As a LOTR fan, I had to watch it. Unfortunately, there weren't any LOTR fans in my friends/family circle, locally. (Only other LOTR fan I knew was 12 hours away in US) Finally, I watched it before I miss my chance. When I reached the movie hall, I realized why there wasn't much publicity (or may be it was other way round). There were hardly any people for the show - may be 30 at the max. That means multiplexes were probably running at a loss (Is there such a thing ?) I watched 3D version - which was most likely HFR version. As others on the interweb have said scenes look surreal. Hence my guess that version I saw was 48FPS one. To explain a little more, it was like looking at HDR photo. HDR photos look like a great painting. But when you look at a photo, you expect \"real like\" quality. I had similar feeling when watching The Hobbit. It looks stunning, but you also get the feel that it isn't real . That. Another complaint I have was that due to 3D glasses having a dark shade, the movie looked less bright. I removed my 3D glasses several times, and saw that projection itself was bright enough, but the 3D glasses made it look dark. I heard few other patrons complaining the same. One girl actually said \"There is some problem with the glasses they gave me, I'm getting a replacement\" (I doubt she did) Since lot of scenes are indoors, in caves and all, there were a LOT of dark (as in less bright) scenes. I have a feeling, when the movie is available on DVD (or when they air it on TV) - it will be 2D (and possibly 24FPS) and would look much nicer. There are others who preferred 2D version as well. Now that technicalities are out of the way, lets review the movie itself. I had read the LOTR books first - all three of them, and then watched the movies. Then I \"ran into\" the Hobbit almost by accident. I was in Bandra on a weekend, and happen to see \"The Hobbit\" at a roadside used-book store. It was a very tiny book compared to three volumes of LOTR. I probably finished it in a day or two (I was working full time then) Point of all this is that when Peter Jackson made 3 movies from the 3 LOTR books, he had to cut down a lot of story line. The movies were still very lengthy compared to most English movies. But here he stretched a single book into three movies. The result is that it feels a slow movie. The folks who haven't read the book would be looking at their watch (I just stopped short of doing that myself) As an example, in \"The Fellowship\" - Tolkien narrates the hobbits' journey out of shire very much in detail. I think the visit to Tom Bombadil alone covered about 100 pages, which was omitted altogether from the movie. But here, Jackson chose to show the initial Dwarf Party at Bilbo's house at length. It doesn't add much value to the movie, IMO. While it has been quite some time since I have read the book, considering that \"The Hobbit\" was written before LOTR books, I doubt it originally contained references to the LOTR movie plots like awakening of Sauron - which eats up some time in the movie at Rivendell. Due to these it takes long time till you reach the adventure part of the story. Since I knew the movie didn't contain the entire book, I kept on thinking - \"Ok so now the movie will end, rest in next part\" at least couple of times, but movie kept on going. About the cast - Martin Freeman does a great job as Bilbo. He looks the age too. As per Wikipedia he is 41 in real life but looks much younger in the movie. Not as young as Frodo in LOTR movies, just right. Ian McKellen as already aced the part of Gandalf. Amongst the Dwarves, Richard Armitage is the only one with better role written for him, and does excellent Job of the Prince who has lost his kingdom. For a totally animated character, Gollum was very expressive. His scenes in the cave with Bilbo probably were the highlight of the movie (and the book, as far a I remember) Next time around, for the second part of the trilogy, I plan to watch the movie in a different movie theater - to check whether the 3D glasses impact the brightness everywhere or whether it was problem with this specific movie hall. I would also try to catch 2D version next time, if they release that.","tags":"posterous","loc":"http://mandarvaze.github.io/2012/12/the-hobbit-an-unexpected-journey.html","title":"Review \"The Hobbit : An Unexpected Journey\""},{"text":"This is the fix for one of the bugs-that-matters in melange subproject of Openstack Feels good :)","tags":"posterous","loc":"http://mandarvaze.github.io/2012/04/my-contribution-to-openstack.html","title":"My First REAL contribution to open source project"},{"text":"मी मागे टेक मराठीच्या मेळव्यामधे \"संगणक वापरून मराठी typing कसे करावे\" ह्या बद्दल एक प्रात्यक्षीक घेतले होते. (त्याच्या slides तुम्हाला इथे मिळतील) तेंव्हा मी फक्त Windows किंवा browser-based software बद्दलच बोललो होतो. त्या नंतर मी विशाल तेलन्ग्रे ह्यांच्या लेखावरून ( link ) Ubuntu 10.10 वर baraha वापरून देवनागरी लिहू शकलो. पण जेंव्हा मी Ubuntu 11.04 ला upgrade केले, तेंव्हा त्या सूचना उपयोगी पडल्या नाहीत (ubuntu मधल्या अंतर्गत बदलांमुळे हे घडले असावे असा अंदाज)मग मी PLUG च्या mailing list वर ह्या विषयावर चर्चा केली तेंव्हा माझा हा problem सुटला. त्या चर्चेचा इतरांना फायदा व्हावा म्हणून ह्या सूचना इथे देत आहे . . . . प्रथम आवश्यक ते software install करण्या साठी : sudo apt-get install ibus-m17n ttf-devanagari-fonts नंतर, Alt-F2 करून, ibus-setup टाईप करावे. मग, विशाल तेलन्ग्रे ह्यांच्या लेखामधे दिल्या प्रमाणे, मराठी भाषा select करावी. मराठी मधला itrans हा पर्याय निवडायला हरकत नाही (मी आधी, baraha साठी प्रयत्न करत होतो, पण नंतर लक्षात आले की itrans हा सुद्धा उत्तम् पर्याय आहे - ह्या सूचने बद्दल - अभिषेक आंबेरकर ह्यांना धन्यवाद)","tags":"marathi","loc":"http://mandarvaze.github.io/2011/10/devnagari-on-ubuntu.html","title":"उबुन्तू ११.०४ मध्ये देवनागरी लेखन"},{"text":"माणूस मोठा होतो म्हणजे काय होतं ?माणसाला किडा, मुंगी, डास चावला तर त्यांचा राग येत नाही, मग दुसऱ्या माणसाने दुखवले तर का राग येतो ? Is it possible to treat other human beings (who hurt you) as \"unevolved creatures\" ? i.e. Not evolved spiritually, not yet mature enough to treat other human with respect, dignity they deserve ? Is it really possible for average human to \"Forgive them 'cause they don't know what they are doing\" ? .... I wish I could.","tags":"marathi","loc":"http://mandarvaze.github.io/2011/09/random-thoughts.html","title":"Thoughts ...."},{"text":"हल्ली कधीही रोजचे वर्तमान पत्र उघडले कि आपल्याला बातम्या दिसतात त्या म्हणजे अपघाताच्या.हे अपघात कुठेही होत असतात, रस्त्यावर, घरात, कार्यालयात. आज सकाळी घरातून बाहेर पडणारा माणूस रात्री घरी येयील का नाही याची चिंता वाटते.१०-१५ वर्षाचा कोवळा जीव अपघातात मृत्यू पावतो तेंव्हा खरोखर काळजाचा ठोका चुकतो. काय चूक असते त्या कोवळ्या जीवाची? रस्त्यावर होणाऱ्या अपघातात एक गोष्ट आढळते , ती म्हणजे जे मृत्यू रस्त्या वरील अपघातात होतात त्यामध्ये त्या अपघातग्रस्त व्यक्तीला त्वरित आणि योग्य ती मदत मिळत नाही. अपघात होणारच आहेत ते असे लगेच थाबणारे नाहीत . मग समाज व्यवस्थेला ,रहदारीला, नियम न पाळणार्यांना, त्याकडे दुर्लक्ष करणाऱ्या पोलिसांना रस्त्यावरील खड्यांना अपुऱ्या सेवांना दोष देत, टीका करत राहण्या पेक्षा, झालेल्या अपघातात मदत कारण हे चांगल नाही का? गर्दी करून घटना पाहणारे लोक खूप असतात पण मदत करायला कुणीच पुढे येत नाही. त्याला करणे देखील बरीच आहेत. सुरक्षिततेचे नियम पाळले पाहिजेत, योजना राबवल्या पाहिजेत हे सर्व करायलाच हवे आहे.पण सध्याच्या अपघातांचे आणि अकाली होणाऱ्या कोवळ्या जीवांच्या मृत्यूंचे काय ? आपण लोक मदती करता का पुढे येत नाहीत कारण त्या अपघातात सापडलेली व्यक्ती आपली कुणी लागत नाही. तुम्ही विचार करा जर अपघातग्रस्त व्यक्ती हि आपली कुणी लागत असती तर ? आपली बहिण, आई, मुलगी , काकू, वडील, भाऊ , मित्र असे कुणी अपघातात सापडले असतील आणि त्यांना योग्य ती मदत , वेळेवर मिळाली नाही आणि म्हणून त्या व्यक्तीचा मृत्यू झाला तर ? आपण जेव्हा अशी अपेक्षा करतो कि माझ्या नातलगाला वेळेवर मदत मिळायला हवी होती तर मग आपण हा देखील विचार केला पाहिजे कि आपण असे कुणाच्या मदतीसाठी थाबतो का ? अकस्मात मृत्यू हा वाईटच, जाणाऱ्या व्यक्तीवर कुणाचे तरी जीवन अवलंबून असते. कुणी तरणाताठा हाताशी आलेला एकुलतात एक मुलगा जाणं हा त्या कुटुंबावर आघात करणारी घटना असते. त्या कुटुंबातील आई, वडील वर्षानुवर्षे त्या धक्यातून बाहेर येऊ शकत नाहीत त्यांच्या आयुष्यात झालेली पोकळी भरून काढता येत नाही. तसेच कुणाचे वडील जाण,भाऊ जाण, आई जाण तेवढाच दुख देणार ठरत. एखाद्याचा हात मोडला, पाय मोडला, टाके पडले तरी ती व्यक्ती आहे याचा त्याच्या घरच्यांना आधार असतो.परंतु गेलेला जीव हा काहीही करून परत येत नाही. कितीही पैसा ओतला तरी. माझ्या दृष्टीनी आपल्या देशाची लोकसंख्या जास्त आहे हे एका दृष्टीनी चांगले आहे कि आज आपण कुठेही एकटे नसतो. सतत आपल्या बरोबर कोणी न कोणी असते. आज आपल्या घराचा दरवाजा सकाळपासून उघडला नाही तर आपला शेजारी दार वाजवून विचारतो कि सगळ ठीक आहे न. आज दरवाजा का उघडला नाही.मुंबईतला २६ जुलै चा पाउस, त्सुनामी, ,दहशतवादी हल्ले या सगळ्यातून असे दिसून येते कि आपल्या देशात मदत करण्याची , विचारपूस करण्याची वृत्ती आहे.मग जर का आपण सगळ्यांनी ठरवलं कि अपघात ग्रस्त व्यक्तीला मदत करायची, रुग्णवाहिका बोलावून हॉस्पिटल मध्ये घेऊन जायचं, तर ते हे अकाली होणारे मृत्यू आपण नक्कीच कमी करू शकू. एखादा अपघात जेंव्हा घडतो मग तो घरात असो, कार्यालयात असो, रस्त्यावर असो. तिथे कोण असत तर तुम्ही, आम्ही असतो. सामान्य जनता असते. पोलीस रुग्णवाहिका, अग्निशामक वाहन हे सर्व नंतर येते. मग जितक्या सामान्य जनतेला मदत कशी करायची हे ठाऊक असेल तितकी मदत करण्याची भावना वाढीस लागेल.घरात कुणाला heart attack आला , कुणाला साप चावला, भाजले, रक्तस्त्राव झाला, आकडी आली, हात, पाय मोडला, तर न घाबरून जाता काय करायचे. त्या व्यक्तीची परिस्थिती गंभीर न करता त्वरित प्रथमोपचार कसा करायचा ह्याचे प्रशिक्षण घेतले गेले पाहिजे असे मला वाटते. जेंव्हा आपण म्हणतो कि on the spot मृत्यू झाला तेंव्हा तो माणूस शेवटचे २-३ मिनिटे शेवटच्या श्वास साठी तडफडत असतो. त्याला त्यावेळी आपण कृत्रिम श्वासोश्वास दिला तर तो माणूस वाचू शकतो. याला international भाषेत (cardio pulmonary resuscitation ) म्हणतात. पुण्यामध्ये आम्ही असे प्रशिक्षण देण्याचे काम करतो. विविध कार्यालये, शाळा, महाविद्यालये, ward offices , कॉर्पोरेट कंपन्या येथे जाऊन आम्ही हे प्रशिक्षण समाजातील सर्व स्तरांवर जाऊन देतो अगदी मोलकरीण संघटना , पुणे विद्यापीठ, बहु विकलांग शाळा अशा सर्व ठिकाणी आम्ही जातो. जगण्याचा अधिकार प्रत्येकाला आहे, तो प्रत्येकाला मिळावा, वेळेवर मदत केली जावी आणि अपघाती मृत्यूंचे प्रमाण कमी व्हावे एवढीच आमची अपेक्षा आणि प्रयत्न आहे. शिल्पा नातू ह्यांचा लेख त्यांच्या परवानगीने इथे पुनर्प्रकाशित केला आहे. मूळ लेख इथे उपलब्ध आहे. ( link )","tags":"marathi","loc":"http://mandarvaze.github.io/2010/12/reduce-accidental-deaths.html","title":"अपघाती मृत्यू कमी करणे आपल्याच हाती"},{"text":"I reached the venue well in time. (Since it was Sunday morning, probably not much people were traveling) I talked to Praseed and Anil near the registration counter - Apparently some people were registering for day two (May be they missed Day 1 due to other commitments ? But I didn't see the point.) We went to the auditorium for the first session of the day. The second day also started with David's session just like Day1. He talked about Polyform Puzzler and Pythonic Algorithm X . Based on previous day's experience, I didn't even bother with WiFi, and used BSNL-3G for connectivity. David started by explaining various polyforms, and how he solved the problem initially by brute force. I learnt about Psycho It is JIT that helps improve the execution speed of algorithmic python code up to 300% - One key takeaway from his session was \"If external tools like Psycho can help improve the speed of your code - then there may be something wrong with your code - Try analyzing and rewriting\" I wanted to attend Noufal's session The Road to PyCon India 2010 but it was going on at the same time as David's session. This is the downside of having multiple parallel tracks - One has to pick and choose. (I also understand, without parallel sessions, conference would run couple more days - and not all sessions are interesting for everyone) Next session I attended was Tracking Tech Trends with Python .It was about how python program can be written to gather information about various topics. It wasn't about tracking technical trends in python, as I had thought. I was a bit disappointed because it was not what I was expecting. (I should have done my home work - my bad) Next session Building Scalable Apps using Google App Engine went well - but he too had a lot of talk about and not enough time. The concepts were generic though. One of the \"tips\" shared was to use NoSQL for datastore as opposed to relational DB - This helps improves the performance, and makes the app scalable. This tied in well with the next session NoSQL Primer . Turns out the presenters were students, and didn't have enough expertise to handle such a \"hot\" topic. To be fair, the audience started asking questions about NoSQL from the get-go, and it was clear that those people asking questions had more information about NoSQL than the presenters. They switched the presenter mid-stream (hoping that new guy would handle queries better) But the new guy was either too new to python (or nervous) that he kept making silly mistakes when typing python code to demo PyMongo to the audience. Audience had to help him with the syntax - kinda embarrassing. Today, experience at lunch went well. No long queues- may be because everyone including organizers and participants learnt from previous day. They also served ice-cream (May be they ran out dessert the previous day ??) I had plenty of time to finish my lunch and go back to the auditorium to check my emails and charge my laptop. Today too, first post lunch session was about GUI programming with python - but instead of QT, it was using GTK. Till before lunch I had no idea what the session named Quickly was going to be about - I checked the page, and decided to attend. I was glad I did. To compare with previous day, the presenter was probably a student, and (may be) bit nervous too. But the presentation was laid out well - accompanied by live demos. The fact that the tool \"quickly\" makes things easier went in favour of this session (as opposed to PyQT) But based on the presentation, I got a feeling that the tool was too tightly coupled with Ubuntu (Later I found out that the defaults can easily be changed to make it generic) The next session Python object model and introduction to meta programming was very informative. The presenter was knowledgeable and patient and explained the concepts very well using the live examples. He too ran out of time, and didn't cover meta programming. Due to the overlap, I missed Praseed's session on Extending and Embedding Python under Windows ( using C/C++ ) I wasn't interested in other sessions that were available and decided to take early tea break. Got to talk to some other folks during the break. By that time, everyone was looking exhausted, and FWIW, none of the post-tea break sessions seemed interesting - Some sessions also were cancelled. They had planned lightening talks in its place, but I didn't attend that. After the early tea break, I attended the session I wanted to attend since PyCon was announced. Python on Mobile phones I wanted this session to go well, and it did.While the session was titled .. on mobile phones .. It was focused on Python on Symbian. The reason why this session went well was because Seshandri had live-projected the image from his Symbian phone on to the screen - so anything he would do on the phone was visible to the entire audience. With such a complex setup - various things can go wrong, but I am glad nothing went wrong - and in my opinion, this was the best session of PyCon India 2010. All in all, this was the first time I attended any technical conference and my experience was great. I am now looking forward to PyCon India 2011","tags":"posterous","loc":"http://mandarvaze.github.io/2010/10/pycon-india-2010-day-2.html","title":"PyCon India 2010 - Day 2"},{"text":"Since I had visited MSRIT the previous day, I had no problem reaching the venue on time. In fact I reached few minutes earlier, David Goodger was still setting things up. I was able to live tweet using the BSNL 3G USB device I had brought with me. The keynote speech went very well. No complex stuff (like his next session on day 2 about polyform puzzler) it was simple and relevant. After the keynote - the organizers announced the pass phrase for the WiFi - So some time was spent trying to connect - but I couldn't actually get \"usable\" internet connectivity. The WiFi would connect, but couldn't get proper Gateway and/or DNS assigned - may be some problem with DHCP. (More about this later) I was getting late for the next session, so I gave up trying to connect to WiFi. PyCon sessions were spread across 3 different halls. Auditorium and Lecture Hall 1 were next to each other, while I had trouble locating Lecture Hall 2 were Dhananjay Nene was going to start his session at 11AM. There were not clear directions, so finally few of us asked the students for the directions to \"HiTech Hall\". Turns out it was in entirely different building, we had to ask few more people for this hall even after reaching the correct building. Dhananjay's session had already started, and the hall was jam-packed. I got myself a place to sit, and started another attempt to connect to WiFi - Turns out several other people were also having trouble connecting. People from mahiti tried to help, but couldn't. Since this hall was underground - I also didn't get BSNL signal and couldn't use 3G modem to connect either (got signal for AirTel, Vodafone, spice etc - but so CellOne) ... and suddenly the lights went off. Power was back within few minutes, but by that time participants had started leaving - It disturbed the flow of the presentation though. The presentation went well - but I was able to attend only part of it. Next session was Beyond Django 101 - This session went OK. I noticed that PyScripter was being used during the session - and made a note to self to try it out. This session too was delayed, and by the time we left for lunch there was a serpentine queue for lunch. There were just too many people around, I was feeling more hungry just looking at the queue. But the food was good. Had to finish the lunch quickly else I would be late for the next session, which I was really looking forward to. First session post-lunch was GUI programing with PyQT by Ankur Gupta. That went well as well. He designed firefox like UI using QT designer. Turns out he had a lot to talk and show, but not enough time. The presentation had to wind up due to lack of time. There was hardly any time for QA session. I had a feeling that people wanted to ask questions, but that would have delayed the next session, so QA was skipped. Later while taking to Ankur during tea break, he mentioned that he felt that he should have covered signals and slots a bit earlier during his talk Next session was Introduction to Image Processing in Python by Anil C R - Initially convered some theory Required quite a bit of background in advanced maths (fourier transform etc) But I learnt about Interactive Python during this session (as part of the demo) This session used live demonstrations heavily which made it very interesting. Next session was Introduction to Semantic Web Programming - I was bored. May be I didn't understand the topic, or was not able to appreciate the topic. By this time, mahiti person was able to get WiFi working in Lecture Hall 2, and I was able to access internet for a while. Turns out - the default DHCP lease was for 8-12 hours, and thus new folks couldn't get IP addresses assigned. When he manually cleared the list, others like myself were able to connect. My very first assignment in python required a lot of text parsing - that was a while ago, but still the next topic was interesting for me none the less : Text Parsing in Python . The session was divided logically into three parts - Built-in string methods, regular expression and parsers. Good examples were given for each. I think audience liked this session, but again the time allotted wasn't sufficient and at the end she had to rush thru rest of the slides. During the Tea break I met several folks and got time to talk to them. Till then it was from session to session, and not enough time to interact with folks. Most part of the day I was in Lecture Hall 2, so I decided to attend the next sessions in auditorium Into 3D with vPython . The presenter was well prepared - and started with some demo of 3D animation. I also liked the style of the slides he used (The ones he used during the session were different that ones that were uploaded on the site) Generally I liked the presentation style, as well as contents. Since WiFi was working OK in the auditorium, I downloaded vPython during the session - something to try later. This was the last session of the day, exhausted I left for day. Looking forward t other next day. On a side note - I noticed that several folks - in the audience as well as presenters were using some flavour of linux - mostly *buntu. Then there were few macs and few Windows 7 laptops (Which I assumed came pre-installed along with the laptop, and folks left it as is and/or dual booted with linux) I was one of the few running XP.","tags":"posterous","loc":"http://mandarvaze.github.io/2010/10/pycon-india-2010-day-1.html","title":"PyCon India 2010 - Day 1"},{"text":"This is the first post in the series about my experience of my first ever Technical conference I attended. .. and I must say it was totally awesome !! Road to PyCon I left Pune on Thursday - so that I can reach B'lore a day earlier. I had booked the tickets for 5.30PM MSRTC bus from Pune-to-B'lore. This was also the day when Ganesh Visarjan processions end. (In Pune the procession lasts more than a day) I reached Swargate a bit earlier to be safe. First thing I did was check the platform where the bus would come. Imagine my shock when I was told that the bus was cancelled !! First person told me that the bus \"did not come from b'lore\" I was asked to get a refund. While finishing the paperwork the person in-charge told that the bus is cancelled starting that day. The bus should make about Rs. 70k - per round trip, but was barely making 30-31k. Lucky for me, he also told me that there would be another KSRTC bus for b'lore in few minutes. Luckily, the 5PM bus was delayed (probably for me :)) The bus was barely 50% full. I got a good seat, and in minutes we left Pune. My PyCon Experience had started on exciting note !! Day 0 I visited MSRIT a day before, so that I am on time for the keynote on Day 1. I was staying on old airport road, and did not have direct connectivity, so I had to travel till Majestic (or KBS as it is officially called) and take another bus from there. Turns out getting a \"Day pass\" works out better, since I had to travel 4-legs a day to and from pycon. Based on my few days experience I think that B'lore has a very good public transport system, when will Pune get similar public transport ? AC Volvo buses are a plenty, and other non-AC buses too. In fact PyCon India 2010 also suggested taking bus to the venue. Update: Details of Day 1 and Day 2","tags":"posterous","loc":"http://mandarvaze.github.io/2010/09/pycon-india-2010-day-zero.html","title":"PyCon India 2010"},{"text":"टेक मराठीच्या पहिल्या सभेत मी मराठी लेखना साठी उपयुक्त अश्या काही साधनांबद्दल माहिती दिली होती. ही सभा जून मध्ये झाली, आणी जुलै मध्ये एपिक browser चे आगमन झाले.बंगलोर स्थित Hidden Reflex ह्या भारतीय startup ने mozilla चे engine वापरून हा भारतीय browser बनवला आहे. मला आवडलेला भाग म्हणजे ह्या browser मधे कुठल्याही एक्स्ट्रा plugin किंवा configuration शिवाय भारतीय भाषां मधून लिहीणे अतिशय सोपे आहे. उ.दा. जर तुम्हाला मराठीतून ट्वीट करयचे असेल तर एपिक browser मधून ते सहज शक्य आहे. पण एपिक वापरत असताना खरे तर ट्वीट करायला ट्विटरच्या वेबसाइट वर जायची गरज नाही कारण ट्विटर साइडबार मधे उपलब्ध आहे. पण जर गूगलचे संकेतस्थळ एपिक browser मधून उघडले तर एखाद्या मराठी शब्दाचा सुद्धा शोध घेता येतो. आजकाल बर्याच मराठी वृत्तपत्रांच्या वेबसाइटवर मराठीतून प्रतिक्रिया नोंदवण्याची सोय असते (टेकमराठी च्या वेबसाइटवर सुद्धा ही सोय आहे) पण जर एखाद्या साईट वर अशी सोय नसेल तरी सुद्धा एपिक browser वापरून मराठी प्रतिक्रिया नोन्दवू शकता. हे झाले एपिकच्या भारतीय भाषा वापरणे सोपे करण्या बद्दल, पण एपिक मधली बाकिची वैशिष्ठ्ये सुद्धा तितकीच महत्वाची आहेत. मुख्य म्हणजे, हा browser - Mozilla वर आधारीत असल्यामुळे, Firefox चे बरेचसे plugins जसेच्या तसे चलण्याची शक्यता खूप जास्त आहे. माझ्यामते ही एक मोठीच जमेची बाजू आहे. शिवाय ह्यात antivirus अंतर्भूत केलेले असल्यामुळे तुम्ही download केलेल्या file आधी scan करण्याची सोय आहे. (ह्या शिवाय anti-virus साईडबार मधून संपूर्ण मशीन सुद्धा scan करता येते) त्या शिवाय साईड्बार अप्लिकेशन्स हे एपिक browser चे महत्वाचे वैशिष्ठ म्हणावे लागेल. एपिक browser मधे बरीच साईड्बार अप्लिकेशन्स आहेत. एपिक ऍप्स मधे जावून पूर्ण सुची बघता येते. त्यातली आपल्याला हवी असणारीच ठेवून बाकीची न दाखवण्याची सुद्धा सोय आहे. ह्यातले मला आवडलेली काही अप्लिकेशन्स : इन्डिक - जर तात्पुरते काही भारतीय भाषेमधे लिहायचे असेल तर ह्याचा उपयोग आहे. सारखे लागणारे मराठी शब्द किंवा वाक्य इथे साठवून ठेवता येतात. anti-virus - ह्या बद्दल आधीच सांगितले आहे to-do - कामाची यादी करता येते. ह्यात एखादे काम विशिष्ठ वेळी पूर्ण करायचे असेल तर अलार्म लावता येतो. मला एक खटकलेली गोष्ट म्हणजे इथे फक्त english entry करता येते. (indic dropdown येत नाही) अर्थात इन्डिक ह्या अप्लिकेशन मधे टाईप करून इथे आणता येते. वर उल्लेख केल्या प्रमाणे ट्विटर पण साईडबार मधे उपलब्ध आहे. ह्या शिवाय जिमेल, याहू, गूगल मॅप सुद्धा आहेत. पण मला ट्विटर अप्लिकेशन इतके हे तीन आवडले नाहीत. जर तुम्हाला एपिक browser चा चेहरा मोहरा आवडला नसेल (लूक ऍन्ड फील) तर skins ह्या साईड्बार अप्लिकेशन मधे जावून तुम्ही तो बदलू शकता. हे अप्लिकेशन mozilla persona वर आधारीत आहे. एपिक मधे write नावाचा HTML editor आहे. अर्थात तो HTML editor आहे ते माहीत नसलं तरी काहीच बिघडत नाही. शिवाय auto-save सुविधेमुळे तुम्ही वेगवेगळ्या files मधे save केलं पाहिजे असंही नाही. तुम्ही ह्याचा वापर scratch pad म्हणून देखील करू शकता. अर्थातच ह्यात सुद्धा भारतीय भाषांमधे लिहिण्याची सोय आहेच. हा editor, Xinha Here! वर आधारीत आहे. snippet नावाचे अप्लिकेशन (firefox च्या scrapbook plugin वर आधारीत) browsing करीत असताना सापडलेल्या महत्वाच्या गोष्टी drag-and-drop इतक्या सोप्या पद्धतीने साठवून ठेवण्यास मदत करते. तुम्ही ह्याचा कात्रणवही म्हणून वापर करू शकता. नंतर ह्या notes मधून योग्य ती माहीती शोधू शकता (खर्या कात्रणवहीतून हवी ती माहीती शोधणे इतके सोपे असते तर ?) अर्थात एपिक नवीन browser असल्या मुळे त्यात काही bugs सुद्धा आहेत, परंतू मला तरी अजून एकही शो-स्टॉपर प्रॉब्लेम सापडलेला नाही. शिवाय एपिक मधील भारतीय भाषां साठी गूगल transliteration services वापरल्या मुळे इंटरनेट connection नसल्यास भारतीय भाषांमधे टाईप करता येत नाही. अर्थात हा web browser असल्यामुळे इंटरनेट connection असावे ही अपेक्षा रास्त आहे. जर तुम्हाला प्रत्यक्ष एपिक browser वापरून बघायचा असेल, तर ह्या संकेतस्थळावरून download करा. टीप : मी आधी हा लेख एपिक write मधे लिहायला सुरूवात केली होती, पण मला बराह सोपे वाटत असल्यामुळे (शिवाय बराहसाठी इंटरनेट connection ची गरज नसल्यामुळे नंतर बराहमधे पूर्ण केला)","tags":"marathi","loc":"http://mandarvaze.github.io/2010/09/intro-to-epic-browser.html","title":"एपिक browser ची ओळख"},{"text":"काल घरी जाताना बस मधून उतरल्या वर खालील संभाषण ऐकले .. मी फक्त जाता जाता एवढेच ऐकले ती: मला जर २ वर्ष लागणार असतील तर तुला ५ वर्ष लागतील (एवढे ऐकल्यावर मी वळून बघितले .. मुलगी दिसायला स्मार्ट होती .. मला वाटले बहुदा graduation किंवा नोकरी मिळण्या बद्दल असेल ..) तो : मला ५ मागण्या आल्या आहेत (मुलाचा चेहेरा दिसू शकला नाही) तुम्हाला काय वाटते .. कश्या बद्दल चर्चा चालू असावी ?","tags":"marathi","loc":"http://mandarvaze.github.io/2010/08/overheard.html","title":"चालता चालता .."},{"text":"काही दिवसांपूर्वी मी एका technical article चा मराठी अनुवाद केला. टेक मराठी ह्या वेबसाईट वर तो प्रकाशित झाला आहे. टेक मराठी बद्दल २ एप्रिल च्या पुणे मिरर मध्ये बातमी [ 1 ] आली आहे, शेवटच्या १-२ परिच्छेदात माझे नाव दिले आहे. माझा अनुवादित लेख इथे[ 2 ] आहे. टेक मराठी बद्दल, तसेच माझ्या अनुवादाबद्दल तुमचे अभिप्राय जरूर कळवा.","tags":"marathi","loc":"http://mandarvaze.github.io/2010/04/tech-marathi-article.html","title":"टेक मराठी"},{"text":"जर आपण स्वत: ला पुणेरी समजत असाल तर आपण हे वाचलेच पाहिजे !! इंग्रजी अनुवाद दिलेला असला तरी मूळ मराठी वाचण्यातच खरी मजा आहे IPL team rules","tags":"marathi","loc":"http://mandarvaze.github.io/2010/03/puneri-ipl.html","title":"पुणेरी IPL चे नियम"},{"text":"मराठी bloggers च्या मेळव्याला जाउन आल्यावर मराठी blog लिहिण्याची उर्मी परात एकदा उफाळून आली.म्हणून मग posterous वरती चक्क वेगळा blog चालू केला.माझ्या मुख्य blog वर पहिला मराठी लघु लेख लिहीला खरा पण तिथे बाकीचेच articles असू देत. तिथे - म्हणजे मेळाव्याला मला बराह बद्दल समजले. तत्पूर्वी मी जीमेल वापरून मराठी लिहिण्यात सन्तुष्ट होतो. पण कायम नवीन काही ना काही शिकत राहीले पाहिजे ना ?समर्थ रामदासांनी सांगितल्या प्रमाणे - \"दिसा माजी काही तरी ते लिहावे ...\" त्या प्रमाणे आता आठवड्यातून जास्तीत जास्त वेळा मराठी लिहायची सवय करायची असे ठरवले आहे. संकल्प सिद्धीस नेण्यास समर्थांचे आशीर्वाद आहेतच. ता. क. : आता वरील लेख लिहिताना मला - barah वापरून अनुस्वार कसा लिहायचा ते समजले. (Shift+M)पण अजूनही blog हा शब्द कसा लिहायचा ते काही जमत नाही. एक तर ब्लोग होतं किंवा ब्लौग होतं. असो.","tags":"marathi","loc":"http://mandarvaze.github.io/2010/01/first-marathi-post.html","title":"प्रथमोध्याय:"},{"text":"आत्ताच मी मराठी blogger's मेळाव्याला जाऊन आलो. तिथे मला बराह ह्या software बद्दल समजले.आत्ता मी हे बराहपॅड वापरून लिहीत आहे. सुरवातीला थोडे अवघड वाटले खरे, पण थोड्याच वेळात बऱ्या पैकी जमू लागले आहे. जर तुम्हाला मराठी मधे blogging करायचे असेल तर barah नक्की वापरून पहा.","tags":"posterous","loc":"http://mandarvaze.github.io/2010/01/braah-vaapruun-mraatthii-blogging.html","title":"बराह वापरून मराठी blogging"},{"text":"Following is taken from the RAQ - Rarely Asked Questions page of Paul Graham's Website. I could not have put it more accurately myself, but it resonates truly with my sentiments. The pointy-haired boss is a manager who doesn't program. So the surest way to avoid becoming him is to stay a programmer. What tempts programmers to become managers are companies with old-fashioned corporate structure, where the only way to advance in salary and prestige is to go into management. So if you want to avoid becoming a PHB, avoid such companies, and work for (or start ) startups. I never had to manage anyone in our startup, even though I was the president. The other hackers were my peers, and would have given me the raspberry if I'd tried to \"manage\" them. We operated by consensus. And the rest of the company reported to our experienced COO, who was also more of a peer. Why be a manager when you could be a founder or early employee at a startup? I have been through the phase of being a manager who didn't program , for the reasons Paul mentions above. Hopefully I learned quickly enough that I didn't like being in that role. While I haven't started my own start up yet, it is definitely one of my goals.","tags":"posterous","loc":"http://mandarvaze.github.io/2009/07/how-can-i-avoid-turning-into-a-phb.html","title":"How can I avoid turning into a PHB ?"},{"text":"This person isn't from IT field, and uses computers just to get her work done (Doesn't everyone these days?) You need to understand this background to appreciate how a non-techy person would describe their experience with MS-DOS The other day, I was talking to her about the days (during my engineering college) when I used to work on DOS. Conversation went something like this. The text in parenthesis are my thoughts , it isn't part of the actual conversation me: Do you know what is DOS ? her : Disk Operating System(wow, I didn't think she would know) me: How did you know ? her : I had to study about it, but all I know is the acronym (Thought so) her : Do you mean MS-DOS ? Ohh, I remember now, it was so boring(why boring ?) her : There were no colors, just a boring black and white screen (Hmm, you have been using computers only post-windows '95 days, no wonder you find DOS boring) her : All I remember is that it used to show - see, two dots, slanting line and greater-than-sign She was trying to explain the MS-DOS Prompt C: \\> (Now read the description again, to make sense of it)","tags":"posterous","loc":"http://mandarvaze.github.io/2009/05/two-dots-and-greater-than.html","title":"see, two dots, slanting line and greater-than-sign"},{"text":"In the Wellness Program I attended few weeks ago, I gathered several useful pieces of wisdom . Here is one such gem. Enjoy !! We have all heard about \"Laughter being the best medicine\". Personally you ask me, when you really need medicine, you are in no position to laugh about it. A better version would be \"Laughter is better way to avoid medicine\". But we aren't talking about laughter here. Sure there are laughter clubs all over India (if not world) but I'm talking about Smile . Surely you know the difference :) During the period in between two sessions of our Wellness Program, I over heard this conversation. Student : I have this constant headache. Counselor : That is because you don't smile. I haven't seen you smile even once during last three days. What are you worried about ? Student : I'm not worried about anything, I'm having a good time. But I'm not a kind of person who smiles for no reason Counselor: Then you should. Seriously. Force yourself to smile. Since you are frowned all the time, you build up this tension. You forehead is always wrinkled. Just smile physically, even if you aren't feeling like smiling. This will help relieve the tension. I never go to hear the aftermath, whether the student did take up smiling (I did see her smiling at least couple of times during rest of the program, so I guess it went well) But this advice stuck with me. Whenever I'm feeling low or angry (and I'm alone) then this advice comes back to me. I have tried this several times since the program, and I must say that it has worked every single time. It is funny really, that I am really angry, boiling mad at something (or someone) but I'm physically smiling. As soon as I smile (OK, may be not as soon as, but soon enough) my emotional state changes to far better mood. Till few days ago, I used to think emotional state of happiness brings out smile in people. But now I have realized that a forced smile, also brings up emotional happiness. Please try this, and let me know if it works for you. Smile Please !!!","tags":"posterous","loc":"http://mandarvaze.github.io/2009/05/smile-please.html","title":"Smile Please !!"},{"text":"This is another story I heard during one of the personal development courses I attended recently. You can read the previous one here Once upon a time in a small town in India, there was a temple. Several devotees visited it both in the morning and in the evening. After a while, one of the very poor person from some nearby place came there. He had lost everything he had. He collapsed outside the temple. People being very nice, helped him with some food, water. He started getting better, but he had no where to go. He setup his bed under nearby tree. Passersby started giving him some money. Eventually, he got better, but by now he had become comfortable being a beggar. He did not try anything else, since he was doing OK just begging. People did not like having a beggar outside the temple, but they continued to offer him small change out of habit, and out of their goodness. After a while, the beggar died. People arranged for his last rites. Then they decided to clean the beggars place so that there won't be any more beggars outside their temple. They cleaned the place. But then the decided to just dig up the place while they are at it, and just be absolutely sure. After a few strikes, they hit something. After careful examination, they found a pot full of gold coin. (They used it renovate the temple) Poor Beggar, he was sitting on a pot of gold his whole life, but never realized, and continued his life begging to people for his day to day survival. Several of us go through life unknowingly sitting on a pot of gold (our skills, unique abilities) never realizing it. What can we do to uncover the hidden potential, so that we don't end up like the beggar in the story ?","tags":"posterous","loc":"http://mandarvaze.github.io/2009/04/beggar-and-pot-of-gold.html","title":"Beggar and The Pot of Gold"},{"text":"I heard this story during one of the personal development courses I attended recently. I think it is worth sharing with you all. There was a man who constantly complained to the God that there is so much misery in the world, and that the God is not taking care of the World he created in the first place. The Man just complained and whined and nothing more. Then one day, The God appeared to him in his dreams. The man complained \"in person\" to The God. After all, how many times does one get to talk to the God, even if it was in your Dreams. The Man made full use of it. The God listened and He smiled. He Said : \"I created the world. Sure there are unhappy people in the world. But I also created You\" That was it. The Man woke up from the Dream. God always speaks in mysterious ways. The Man had no clue what the God meant. He was just happy that he could complain to the God Herself. Days Passed. The Man was back to his routine on whining. After after a few days, there was another dream. The Man saw that there was a wounded Fox, who could not hunt for food. The Fox was weakening. The Man thought : \"I was right. There is so much sadness in this world. The God isn't doing his job\". Then he saw there was a lion(ess?) who had hunted a dear. The Lion ate just the portion of his kill, and left. The wounded fox was near by. As soon as the lion left, he quickly approached the carcass, the ate rest of the dear. Now the God appeared, and said to the man : \"I created this fox, who is now wounded. But I took care of him as well. I made sure that even in his physical condition, he gets to eat.\" The Next Day, the man decided that he need to do anything. He just strolled around the house. Did not go to work. The day passed, he got hungry. But no one served him the food. He was sad. Since he had not eaten through out the day, he felt weak, and dozed off. In the dream, the God appeared to the Man. Man started complaining again : \" God, I trusted you. Yesterday you told me that you take care of everyone. .. and today, I had to go hungry the entire day. That is not fair\" The God smiled and said : \"I did not make you the Fox. I made you the Lion\" I think this is very thought provoking story. Lot of us go through the life thinking that someone will help us. But how many of us realize that \"We are the Lion\" ?","tags":"posterous","loc":"http://mandarvaze.github.io/2009/04/man-and-the-god.html","title":"A Man and The God"},{"text":"I came across a blog article which captured the the trend in \"Indian IT industry\" accurately. The article talks about how the senior person in a role of a developer is considered \"Stuck\" coding. It does not come easily to folks that it could be by choice. One of the reasons I quit Avaya (as a manager) was because I was not enjoying my work, solving people problems (non-technical) For a \"techie at heart\" person like myself, it was not at all satisfying. There was a time, when one of the VP (from US) visited our Avaya office. He was comparing his Senior Technical people with what we call \"Senior\" Technical people in India. In US, the senior person was at least 10+ yrs experience. He/she has to interact with person with experience of 3-5 yrs, as their peer. Add to that the fact that most of those people (or their colleagues) were losing jobs, due to economic down turn, and it was as clear as a day light, that friction was inevitable. In my own experience, the senior tech leaders in US had a very frustrating time dealing with their Indian counterparts. (Unfortunately I was stuck in between solving the \"people\" issues on both sides) I was told (back then I wasn't a manager) that things are bound to change, and we'll see real technical jobs in Indian IT industry requiring higher experience.I think things are changing a little, but it takes people like you and me, to ensure that when some organization is looking for senior technical person, they have a choice from a pool of talented engineers with 10-15+ yrs experience. After quitting Avaya, I joined another org as Software Architect , unfortunately even here, they are trying to make me a \"manager\" just due to number of years of experience. So currently I am pushing back with my management, and trying to stay \"hands on\" person. Here is the original article","tags":"posterous","loc":"http://mandarvaze.github.io/2009/04/stuck-in-code.html","title":"Stuck in Code"},{"text":"I came across this article in New York Magazine, which talks about how US President Mr. Obama is talking to \"everyone\", not just the \"regulars\". The following quote from the article is worth pondering : spending too much time in the company of like-minded people serves only to exaggerate your own views and make you less tolerant of differing opinions. Read the full article here","tags":"posterous","loc":"http://mandarvaze.github.io/2009/04/virtues-of-open-mindedness.html","title":"Virtues of open-mindedness"}]}